; domain
(define (domain restaurantA)
	(:requirements :strips :adl :typing :fluents)

	(:types
		robot - object
		customer - object
		plate - object
		location
	)

	(:predicates
		(at ?obj - object ?loc - location)
		(adjacent ?loc1 - location ?loc2 - location)
		(hasFood ?p - plate)
		(hasPlate ?r - robot)
		(holding ?r - robot ?p - plate)
		(served ?c - customer)
		(buffet ?loc - location)
	)

	(:action pick-up
		:parameters (?r - robot ?p - plate ?loc - location)
		:precondition (and
			(at ?r ?loc)
			(at ?p ?loc)
			(not (hasPlate ?r))
		)
		:effect (and
			(holding ?r ?p)
			(hasPlate ?r)
		)
	)

	(:action present
		:parameters (?r - robot ?p - plate ?loc - location ?c - customer)
		:precondition (and
			(at ?c ?loc)
			(at ?r ?loc)
			(holding ?r ?p)
			(hasFood ?p)
			(not (served ?c))
		)
		:effect (and
			(served ?c)
			(not (holding ?r ?p))
			(not (hasPlate ?r))
		)
	)

	(:action fill
		:parameters (?r - robot ?p - plate ?loc - location)
		:precondition (and
			(at ?r ?loc)
			(buffet ?loc)
			(holding ?r ?p)
			(not (hasFood ?p))
		)
		:effect (and
			(hasFood ?p)
		)
	)

	(:action move
		:parameters (?r - robot ?loc1 - location ?loc2 - location)
		:precondition (and
			(at ?r ?loc1)
			(adjacent ?loc1 ?loc2)
			(not (hasPlate ?r))
		)
		:effect (and
			(at ?r ?loc2)
			(not (at ?r ?loc1))
		)
	)

	(:action move_plate
		:parameters (?r - robot ?p - plate ?loc1 - location ?loc2 - location)
		:precondition (and
			(at ?r ?loc1)
			(adjacent ?loc1 ?loc2)
			(holding ?r ?p)
		)
		:effect (and
			(at ?r ?loc2)
			(not (at ?r ?loc1))
			(at ?p ?loc2)
			(not (at ?p ?loc1))
		)
	)
)

; problem
(define (problem problem2)
  (:domain restaurantA)
  
  ;; Define objects

  (:objects
    robot - robot
    plate1 - plate
    plate2 - plate
    plate3 - plate
    customer1 - customer
    customer2 - customer
    customer3 - customer
    BTA AMA AUA PLA PMA PUA ALA - location
  )
  
  (:init

    ;; Robot initialization

    (at robot BTA)

    ;; Plate initialization

    (at plate1 BTA)
    (at plate2 BTA)
    (at plate3 BTA)

    ;; Customer initialization

    (at customer1 PMA)
    (at customer2 ALA)
    (at customer3 PLA)

    ;; Define adjacent rooms

    (adjacent BTA AUA) (adjacent AUA BTA)
    (adjacent AUA AMA) (adjacent AMA AUA)
    (adjacent AUA PUA) (adjacent PUA AUA)
    (adjacent PUA PMA) (adjacent PMA PUA)
    (adjacent PMA PLA) (adjacent PLA PMA)
    (adjacent AMA ALA) (adjacent ALA AMA)
    (adjacent PLA ALA) (adjacent ALA PLA)

    ;; Specify in which room the buffet is located
    (buffet BTA)
  )
  
  ;; Define the goal state

  (:goal
    (and 
      (at robot BTA)
      (served customer1) (served customer2) (served customer3)
    )
  )
)

; plan
1. (pick-up robot plate1 bta)
   added: (holding robot plate1) (hasplate robot)
   goals met: 1 of 4
2. (fill robot plate1 bta)
   added: (hasfood plate1)
   goals met: 1 of 4
3. (move_plate robot plate1 bta aua)
   deleted: (at robot bta) (at plate1 bta)
   added: (at robot aua) (at plate1 aua)
   goals met: 0 of 4
4. (move_plate robot plate1 aua ama)
   deleted: (at robot aua) (at plate1 aua)
   added: (at robot ama) (at plate1 ama)
   goals met: 0 of 4
5. (move_plate robot plate1 ama ala)
   deleted: (at robot ama) (at plate1 ama)
   added: (at robot ala) (at plate1 ala)
   goals met: 0 of 4
6. (present robot plate1 ala customer2)
   deleted: (holding robot plate1) (hasplate robot)
   added: (served customer2)
   goals met: 1 of 4
7. (pick-up robot plate1 ala)
   added: (holding robot plate1) (hasplate robot)
   goals met: 1 of 4
8. (move_plate robot plate1 ala pla)
   deleted: (at robot ala) (at plate1 ala)
   added: (at robot pla) (at plate1 pla)
   goals met: 1 of 4
9. (present robot plate1 pla customer3)
   deleted: (holding robot plate1) (hasplate robot)
   added: (served customer3)
   goals met: 2 of 4
10. (pick-up robot plate1 pla)
   added: (holding robot plate1) (hasplate robot)
   goals met: 2 of 4
11. (move_plate robot plate1 pla pma)
   deleted: (at robot pla) (at plate1 pla)
   added: (at robot pma) (at plate1 pma)
   goals met: 2 of 4
12. (present robot plate1 pma customer1)
   deleted: (holding robot plate1) (hasplate robot)
   added: (served customer1)
   goals met: 3 of 4
13. (move robot pma pua)
   deleted: (at robot pma)
   added: (at robot pua)
   goals met: 3 of 4
14. (move robot pua aua)
   deleted: (at robot pua)
   added: (at robot aua)
   goals met: 3 of 4
15. (move robot aua bta)
   deleted: (at robot aua)
   added: (at robot bta)
   goals met: 4 of 4
